"""
Задание 6. Ввести с клавиатуры два целых числа: x и y
    - Вывести на экран консоли оба числа используя только один вызов print()
    - Вычислить сумму чисел
    - Выполнить целочисленное деление
    - Найти остаток
    - Вычислить степень числа: x^y
"""

x = 86
y = 13
print(x, y)     # Вывести на экран консоли оба числа используя только один вызов print()
print(x + y)    # Вычислить сумму чисел
print(x // y)   # Выполнить целочисленное деление
print(x % y)    # Найти остаток
print(x ** y)   # Вычислить степень числа: x^y