"""

Задание 7. Напишите программу, которая считывает три числа и выводит их сумму и произведение. Каждое число записано в
отдельной строке.

"""

a = 12
b = 46
c = 7
y = a + b + c
print('Result of sum {A}, {B} and {C}: {Y}'.format(A=a, B=b, C=c, Y=y))
y = a * b * c
print('Result of multiplication {}, {} and {}: {}'.format(a, b, c, y))