"""

Задание 11. Напишите программу, которая приветствует пользователя, выводя слово `Hello`,
введенное имя и знаки препинания по образцу: `Hello Kitty!`

"""

n = input('Hello! Please, enter your name: ')
print('\'Hello', n, '\b!\'')
